<a href="https://colab.research.google.com/github/UniLu-DMDB/UniLu-DMDB.github.io/blob/main/CyclingDB_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

University of Lucerne

Data Modeling and Database Systems

# Exercises - CyclingDB - SQL

## 1. Preparation

We start by setting up a connection to our database.

In [4]:
#@title Install PostgreSQL
#@markdown Run this cell to setup the full PostgreSQL environment. **Note that all your data is lost after restarting the runtime.**

%%capture
# Install postgresql server
!sudo apt-get -y -qq update
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start

# Setup a password `postgres` for username `postgres`
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

In [5]:
# import all Python packages
from sqlalchemy import create_engine
from sqlalchemy import URL

import pandas as pd

In [6]:
# load the SQL magic extension
# https://github.com/catherinedevlin/ipython-sql
# this extension allows us to connect to DBs and issue SQL command
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [8]:
# download data
!wget https://unilu-dmdb.github.io/data/CyclingDB.sql

--2025-01-28 20:58:55--  https://unilu-dmdb.github.io/data/CyclingDB.sql
Resolving unilu-dmdb.github.io (unilu-dmdb.github.io)... 185.199.108.153, 185.199.109.153, 185.199.110.153, ...
Connecting to unilu-dmdb.github.io (unilu-dmdb.github.io)|185.199.108.153|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 3574 (3.5K) [application/sql]
Saving to: ‘CyclingDB.sql’

CyclingDB.sql       100%[===================>]   3.49K  --.-KB/s    in 0s

2025-01-28 20:58:55 (44.8 MB/s) - ‘CyclingDB.sql’ saved [3574/3574]

In [9]:
# load data into database
!sudo -u postgres psql -U postgres -a -f CyclingDB.sql

CREATE TABLE CyclingEvent (
	EvID INT PRIMARY KEY,
	EventName VARCHAR(100) NOT NULL,
	Location VARCHAR(100) NOT NULL,
	Year VARCHAR(100) NOT NULL,
	DistanceKM SMALLINT
);
CREATE TABLE
CREATE TABLE Sponsor (
	SpID INT PRIMARY KEY,
	SponsorName VARCHAR(100) NOT NULL,
	EvID INT REFERENCES CyclingEvent(EvID),
	AmountCHF INT
);
CREATE TABLE
CREATE TABLE Cyclist (
	CID INT PRIMARY KEY,
	Name VARCHAR(100) NOT NULL,
	Birthday VARCHAR(100) NOT NULL,
	Gender VARCHAR(1) NOT NULL,
	Club VARCHAR (100) NOT NULL
);
CREATE TABLE
CREATE TABLE StartingList (
	StartNumber INT PRIMARY KEY,
	EvID INT REFERENCES CyclingEvent(EvID),
	CID INT REFERENCES Cyclist(CID)
);
CREATE TABLE
CREATE TABLE Results (
	ResID INT PRIMARY KEY,
	StartNumber INT REFERENCES StartingList(StartNumber),
	Category VARCHAR(30) NOT NULL,
	CyclingTime VARCHAR(30)
);
CREATE TABLE
-- Inserting data into CyclingEvent table
INSERT INTO CyclingEvent (EvID, EventName, Location, Year, DistanceKM)
VALUES
(1, 'Lucerne Fun Ride', 'Lucerne', '2024', 50),
(2, 'Basel Hill Climbing Challenge', 'Basel', '2024', 20),
(3, 'Lucerne Lake Loop', 'Lucerne', '2024', 100),
(4, 'Berne Run Challenge', 'Bern', '2024', 25),
(5, 'Alps Adventure Tour', 'Interlaken', '2024', 150),
(6, 'Rhine Valley Ride', 'Zurich', '2024', 100);
INSERT 0 6
-- Inserting data into Sponsor table
INSERT INTO Sponsor (SpID, SponsorName, EvID, AmountCHF)
VALUES
(1, 'Swiss Chocolate Co.', 1, 15000),
(2, 'Pharma Inc.', 2, 12000),
(3, 'Clock Tower Watches', 3, 10000),
(4, 'Swiss Bank & Trust', 4, 18000),
(5, 'Alpine Adventures', 5, 25000),
(6, 'Zurich Bank', 6, 20000);
INSERT 0 6
-- Inserting data into Cyclist table
INSERT INTO Cyclist (CID, Name, Birthday, Gender, Club)
VALUES
(1, 'Chocolate Charlie', '1992-05-08', 'M', 'Lucerne Sweet Riders'),
(2, 'Hiking Heidi', '1994-09-15', 'F', 'Alpine Adventure Cyclists'),
(3, 'Lakeside Liam', '1991-02-20', 'M', 'Lucerne Lake Lovers'),
(4, 'Cheesehead Chloe', '1993-07-10', 'F', 'Swiss Cheese Cyclers'),
(5, 'Skiing Steve', '1988-11-28', 'M', 'Lucerne Snowy Peaks'),
(6, 'Fondue Fiona', '1990-03-18', 'F', 'Alpine Appetite Riders'),
(7, 'Yodeling Yuri', '1989-06-25', 'M', 'Lucerne Mountain Musicians'),
(8, 'Alphorn Anna', '1995-12-05', 'F', 'Swiss Sound Cyclers'),
(9, 'Cuckoo Clock Carl', '1996-08-20', 'M', 'Lucerne Time Travellers'),
(10, 'Hearty Helga', '1993-04-12', 'F', 'Alpine Heartbeat Riders');
INSERT 0 10
-- Inserting data into StartingList table
INSERT INTO StartingList (StartNumber, EvID, CID)
VALUES
(5, 1, 1),
(6, 1, 2),
(7, 1, 3),
(8, 1, 4),
(9, 2, 5),
(10, 2, 6),
(11, 2, 7),
(12, 2, 8),
(13, 3, 9),
(14, 3, 10),
(15, 4, 2),
(16, 4, 4),
(17, 4, 6),
(18, 4, 8),
(19, 4, 10),
(20, 5, 3),
(21, 5, 5),
(22, 5, 7),
(23, 5, 9),
(24, 5, 1),
(25, 6, 2),
(26, 6, 4),
(27, 6, 6),
(28, 6, 8),
(29, 6, 10);
INSERT 0 25
-- Inserting data into Results table
INSERT INTO Results (ResID, StartNumber, Category, CyclingTime)
VALUES
(5, 5, 'Amateur', '02:30:15'),
(6, 6, 'Professional', '01:40:30'),
(7, 7, 'Amateur', '02:15:45'),
(9, 9, 'Amateur', '02:25:10'),
(10, 10, 'Professional', '01:35:55'),
(11, 11, 'Amateur', '02:20:30'),
(12, 12, 'Professional', '01:55:40'),
(13, 13, 'Amateur', '02:28:20'),
(14, 14, 'Professional', '01:48:10'),
(15, 15, 'Amateur', '02:10:25'),
(17, 17, 'Amateur', '02:20:50'),
(18, 18, 'Professional', '01:45:30'),
(19, 19, 'Amateur', '02:18:15'),
(20, 20, 'Professional', '03:20:45'),
(21, 21, 'Amateur', '04:05:30'),
(22, 22, 'Professional', '02:55:10'),
(23, 23, 'Amateur', '04:10:20'),
(24, 24, 'Professional', '03:00:55'),
(25, 25, 'Amateur', '03:45:20'),
(26, 26, 'Professional', '02:30:45'),
(28, 28, 'Professional', '02:45:30'),
(29, 29, 'Amateur', '03:50:15');
INSERT 0 22

In [10]:
%sql postgresql://postgres:postgres@localhost:5432/postgres

## 2. Exercises

Fill in the solutions and compare them to the results shown. If you want to see how to get to the results, click on "Show code" below the title "Solution".

### What are the names of all cyclists of the Lucerne 'Lucerne Lake Loop' 2024?

In [ ]:
%%sql
<<YOUR SOLUTION>>

In [11]:
#@title Solution
%%sql
SELECT name
FROM Cyclist c
INNER JOIN StartingList sl USING (CID)
INNER JOIN CyclingEvent ce USING (EvID)
WHERE ce.EventName = 'Lucerne Lake Loop'
AND ce.Year = '2024'

 * postgresql://postgres:***@localhost:5432/postgres
   sqlite:///cycling.db
2 rows affected.

[('Cuckoo Clock Carl',), ('Hearty Helga',)]

### At which cycling events (return only the name) has 'Chocolate Charlie' participated so far? Note that the event should only appear once in the result list (even if the person participated to multiple tours of the event).

In [ ]:
%%sql
<<YOUR SOLUTION>>

In [12]:
#@title Solution
%%sql
SELECT DISTINCT EventName
FROM CyclingEvent ce
INNER JOIN StartingList sl USING (EvID)
INNER JOIN Cyclist c USING (CID)
WHERE name = 'Chocolate Charlie'

 * postgresql://postgres:***@localhost:5432/postgres
   sqlite:///cycling.db
2 rows affected.

[('Alps Adventure Tour',), ('Lucerne Fun Ride',)]

### Which sponsors of the 'Lucerne Fun Ride' taking place in 2024 sponsored more than Fr. 10.-?

In [ ]:
%%sql
<<YOUR SOLUTION>>

In [13]:
#@title Solution
%%sql
SELECT SponsorName
FROM Sponsor s
INNER JOIN CyclingEvent ce ON (s.EvID = ce.EvID)
WHERE ce.EventName = 'Lucerne Fun Ride' AND ce.Year = '2024' AND s.AmountCHF >= 10

 * postgresql://postgres:***@localhost:5432/postgres
   sqlite:///cycling.db
1 rows affected.

[('Swiss Chocolate Co.',)]

### Return the top 3 locations by number of cycling events taking place at the given location.

In [ ]:
%%sql
<<YOUR SOLUTION>>

In [14]:
#@title Solution
%%sql
SELECT Location
FROM CyclingEvent ce
INNER JOIN StartingList sl ON (sl.EvID = ce.EvID)
GROUP BY Location
ORDER BY COUNT(StartNumber) DESC
LIMIT 3

 * postgresql://postgres:***@localhost:5432/postgres
   sqlite:///cycling.db
3 rows affected.

[('Lucerne',), ('Bern',), ('Zurich',)]

### Return the number of cyclists for the cycling event 'Rhine Valley Ride' that took place in Zurich in 2024.

In [ ]:
%%sql
<<YOUR SOLUTION>>

In [15]:
#@title Solution
%%sql
SELECT COUNT(StartNumber) AS c
FROM CyclingEvent ce
INNER JOIN StartingList sl ON (sl.EvID = ce.EvID)
WHERE EventName = 'Rhine Valley Ride' AND Location = 'Zurich' AND Year = '2024'

 * postgresql://postgres:***@localhost:5432/postgres
   sqlite:///cycling.db
1 rows affected.

[(5,)]

### List all distinct cyclist’s name who participated to a cycling event in 2024, but did not end the cycling tour, i.e., there is no result?

In [ ]:
%%sql
<<YOUR SOLUTION>>

In [16]:
#@title Solution
%%sql
SELECT DISTINCT name
FROM Cyclist c
INNER JOIN StartingList sl ON (c.CID = sl.CID)
INNER JOIN CyclingEvent ce ON (ce.EvID = sl.EvID)
WHERE ce.Year = '2024'
AND NOT EXISTS (SELECT * FROM Results r WHERE r.StartNumber = sl.StartNumber)

 * postgresql://postgres:***@localhost:5432/postgres
   sqlite:///cycling.db
2 rows affected.

[('Cheesehead Chloe',), ('Fondue Fiona',)]